tap "anomalyco/tap"
tap "cormacrelf/tap"
tap "nicholasraimbault/neon"
tap "nikitabobko/tap"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# OpenType text shaping engine
brew "harfbuzz"
# JPEG image codec that aids compression and decompression
brew "jpeg-turbo"
# Download media content from a DASH-MPEG or DASH-WebM MPD manifest
brew "dash-mpd-cli"
# TIFF library and utilities
brew "libtiff"
# Load/unload environment variables based on $PWD
brew "direnv"
# Intelligent archive extraction
brew "dtrx"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Open-source GitLab command-line tool
brew "glab"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Linear Algebra PACKage
brew "lapack"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Optimized BLAS library
brew "openblas"
# Package management made easy
brew "pixi"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Software environment for statistical computing
brew "r"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Parser generator tool
brew "tree-sitter-cli"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Access X11 clipboards from the command-line
brew "xclip"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode"
# Watcher for macOS 10.14+ light/dark mode changes
brew "cormacrelf/tap/dark-notify"
# Fix DRM playback in Chromium-based browsers on macOS
brew "nicholasraimbault/neon/neon"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application launcher and productivity software
cask "alfred"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool"
# Desktop password and login vault
cask "bitwarden"
# Calendar software focusing on flexibility and reliability
cask "busycal"
# App to write and organise your ideas
cask "capacities"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Block websites, games and applications
cask "cold-turkey-blocker"
# Databases and SQL IDE
cask "datagrip"
# Client for the Dropbox cloud storage service
cask "dropbox"
cask "font-jetbrains-mono-nerd-font"
cask "font-noto-sans-math"
cask "font-symbols-only-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# AI-powered notepad for meetings
cask "granola"
# Speech to text application
cask "handy"
# Chromium-based web browser
cask "helium-browser"
# Desktop shield and keystroke interceptor
cask "keyboard-cleaner"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Shows the next meeting in the menu bar
cask "meetingbar"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Scheduling application focusing on organisation
cask "omnifocus"
# Note taking application and information organiser
cask "omnioutliner"
# Scientific and technical publishing system built on Pandoc
cask "quarto"
# Data science software focusing on R and Python
cask "rstudio"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Unpacks archive files
cask "the-unarchiver"
# Native desktop client for WhatsApp
cask "whatsapp"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen"
# Collect, organise, cite, and share research sources
cask "zotero"
cargo "md2nb"
