tap "cormacrelf/tap"
tap "nikitabobko/tap"
brew "libpng"
brew "freetype"
brew "cormacrelf/tap/dark-notify"
brew "direnv"
brew "fd"
brew "fribidi"
brew "gcc"
brew "harfbuzz"
brew "jpeg-turbo"
brew "lapack"
brew "libgit2"
brew "libtiff"
brew "neovim"
brew "nvm"
brew "openblas"
brew "pixi"
brew "pkgconf"
brew "r"
brew "ripgrep"
brew "tmux"
brew "tree"
brew "tree-sitter-cli"
brew "uv"
brew "webp"
brew "wget"
brew "xclip"
cask "nikitabobko/tap/aerospace"
cask "alacritty"
cask "alfred"
cask "bettertouchtool"
cask "bitwarden"
cask "busycal"
cask "capacities"
cask "claude"
cask "claude-code"
cask "cold-turkey-blocker"
cask "datagrip"
cask "gcloud-cli"
cask "google-chrome"
cask "keyboard-cleaner"
cask "meetingbar"
cask "nordvpn"
cask "obsidian"
cask "omnifocus"
cask "omnioutliner"
cask "rstudio"
cask "slack"
cask "spotify"
cask "the-unarchiver"
cask "whatsapp"
cask "zed"
cask "zen"
cask "zotero"
